'use strict';

/** @type {import('sequelize-cli').Migration} */
module.exports = {
  async up (queryInterface, Sequelize) {
     await queryInterface.bulkInsert('Questions', [
      {
       name: 'Что часто делает начинающий игрок в настольный теннис, когда мячик летит прямо на него?',
       category_id: 1,
      },
      {
        name: 'Почему ракетки и мячи для настольного тенниса всегда счастливы?',
        category_id: 1,
       },
       {
        name: 'Как игроки настольного тенниса называют момент, когда они побеждают соперника всего за несколько ударов?',
        category_id: 1,
       },
       {
        name: 'Какие качества делают игрока настольного тенниса настоящей звездой?',
        category_id: 1,
       },
       {
        name: 'Как игроки настольного тенниса могут решить разногласия после матча?',
        category_id: 1,
       },
       {
        name: 'Какая характерная фраза исходит от игрока в настольный теннис, когда он хорошо ударяет по мячу?',
        category_id: 1,
       },
      {
        name: 'Мотылек замкнул крылышками контакты. Какое жаргонное слово в программировании появилось по этому случаю?',
        category_id: 2,
       },
       {
        name: 'Какого числа отмечается День программиста (256 день в году) в високосный год?',
        category_id: 2,
       },
       {
        name: 'Если бы осьминоги умели считать, то какой бы системой они скорее всего пользовались? ',
        category_id: 2,
       },
       {
        name: 'Излюбленное мясное блюдо всех программистов — это ...?',
        category_id: 2,
       },
       {
        name: '“Открой окошко — разорю тебя немножко”. О чем это?',
        category_id: 2,
       },
       {
        name: 'Все знают, что «404 Not Found» — HTTP-код ошибки, когда в браузере по тем или иным причинам не может быть открыт указанный URL-адрес. А что значит шуточная «Ошибка 418»?',
        category_id: 2,
       },
       

    ], {});
    
  },

  async down (queryInterface, Sequelize) {
   
     await queryInterface.bulkDelete('Questions', null, {});
     
  }
};
